reports/stage6/wrkLogsGet1.txt
Running 1m test @ http://localhost:8080
  2 threads and 20 connections
  Thread calibration: mean lat.: 2.114ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.136ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.28ms  695.32us  15.17ms   73.43%
    Req/Sec   526.84    111.83     0.90k    65.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.26ms
 75.000%    2.66ms
 90.000%    3.04ms
 99.000%    4.23ms
 99.900%    7.25ms
 99.990%   11.49ms
 99.999%   15.18ms
100.000%   15.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.536     0.000000            1         1.00
       1.429     0.100000         4999         1.11
       1.724     0.200000         9992         1.25
       1.938     0.300000        14995         1.43
       2.109     0.400000        20003         1.67
       2.259     0.500000        25012         2.00
       2.337     0.550000        27518         2.22
       2.411     0.600000        29984         2.50
       2.489     0.650000        32492         2.86
       2.571     0.700000        35014         3.33
       2.661     0.750000        37501         4.00
       2.709     0.775000        38731         4.44
       2.761     0.800000        39977         5.00
       2.817     0.825000        41226         5.71
       2.879     0.850000        42458         6.67
       2.955     0.875000        43723         8.00
       2.997     0.887500        44350         8.89
       3.043     0.900000        44963        10.00
       3.097     0.912500        45584        11.43
       3.155     0.925000        46203        13.33
       3.223     0.937500        46828        16.00
       3.269     0.943750        47150        17.78
       3.311     0.950000        47453        20.00
       3.365     0.956250        47765        22.86
       3.437     0.962500        48077        26.67
       3.523     0.968750        48391        32.00
       3.575     0.971875        48547        35.56
       3.627     0.975000        48705        40.00
       3.691     0.978125        48862        45.71
       3.785     0.981250        49012        53.33
       3.897     0.984375        49171        64.00
       3.969     0.985938        49247        71.11
       4.055     0.987500        49326        80.00
       4.163     0.989062        49403        91.43
       4.287     0.990625        49484       106.67
       4.439     0.992188        49559       128.00
       4.555     0.992969        49598       142.22
       4.643     0.993750        49637       160.00
       4.763     0.994531        49675       182.86
       4.907     0.995313        49715       213.33
       5.047     0.996094        49754       256.00
       5.119     0.996484        49773       284.44
       5.263     0.996875        49792       320.00
       5.443     0.997266        49812       365.71
       5.699     0.997656        49832       426.67
       5.987     0.998047        49851       512.00
       6.083     0.998242        49861       568.89
       6.299     0.998437        49870       640.00
       6.787     0.998633        49880       731.43
       7.091     0.998828        49890       853.33
       7.299     0.999023        49900      1024.00
       7.479     0.999121        49905      1137.78
       7.679     0.999219        49909      1280.00
       7.895     0.999316        49914      1462.86
       8.335     0.999414        49919      1706.67
       8.583     0.999512        49924      2048.00
       8.727     0.999561        49927      2275.56
       8.871     0.999609        49930      2560.00
       8.999     0.999658        49931      2925.71
       9.175     0.999707        49934      3413.33
       9.807     0.999756        49936      4096.00
      10.935     0.999780        49938      4551.11
      11.047     0.999805        49939      5120.00
      11.127     0.999829        49940      5851.43
      11.375     0.999854        49941      6826.67
      11.415     0.999878        49942      8192.00
      11.487     0.999890        49943      9102.22
      11.847     0.999902        49944     10240.00
      11.847     0.999915        49944     11702.86
      12.023     0.999927        49945     13653.33
      12.023     0.999939        49945     16384.00
      13.159     0.999945        49946     18204.44
      13.159     0.999951        49946     20480.00
      13.159     0.999957        49946     23405.71
      14.303     0.999963        49947     27306.67
      14.303     0.999969        49947     32768.00
      14.303     0.999973        49947     36408.89
      14.303     0.999976        49947     40960.00
      14.303     0.999979        49947     46811.43
      15.175     0.999982        49948     54613.33
      15.175     1.000000        49948          inf
#[Mean    =        2.278, StdDeviation   =        0.695]
#[Max     =       15.168, Total count    =        49948]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution
 50.000%    1.40ms
 75.000%    1.70ms
 90.000%    2.03ms
 99.000%    3.26ms
 99.900%    6.02ms
 99.990%   10.06ms
 99.999%   13.58ms
100.000%   13.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.368     0.000000            1         1.00
       0.969     0.100000         5021         1.11
       1.097     0.200000        10004         1.25
       1.204     0.300000        14998         1.43
       1.300     0.400000        20031         1.67
       1.398     0.500000        25002         2.00
       1.451     0.550000        27500         2.22
       1.505     0.600000        29977         2.50
       1.562     0.650000        32478         2.86
       1.626     0.700000        35005         3.33
       1.698     0.750000        37477         4.00
       1.736     0.775000        38713         4.44
       1.781     0.800000        39981         5.00
       1.830     0.825000        41210         5.71
       1.889     0.850000        42465         6.67
       1.957     0.875000        43708         8.00
       1.992     0.887500        44334         8.89
       2.033     0.900000        44956        10.00
       2.081     0.912500        45597        11.43
       2.133     0.925000        46210        13.33
       2.203     0.937500        46831        16.00
       2.245     0.943750        47146        17.78
       2.295     0.950000        47454        20.00
       2.357     0.956250        47773        22.86
       2.425     0.962500        48076        26.67
       2.517     0.968750        48393        32.00
       2.575     0.971875        48550        35.56
       2.643     0.975000        48702        40.00
       2.725     0.978125        48857        45.71
       2.815     0.981250        49013        53.33
       2.921     0.984375        49170        64.00
       2.987     0.985938        49247        71.11
       3.075     0.987500        49326        80.00
       3.197     0.989062        49402        91.43
       3.301     0.990625        49481       106.67
       3.437     0.992188        49558       128.00
       3.539     0.992969        49597       142.22
       3.639     0.993750        49637       160.00
       3.785     0.994531        49676       182.86
       3.943     0.995313        49714       213.33
       4.143     0.996094        49753       256.00
       4.275     0.996484        49773       284.44
       4.391     0.996875        49792       320.00
       4.523     0.997266        49812       365.71
       4.699     0.997656        49831       426.67
       4.979     0.998047        49851       512.00
       5.131     0.998242        49861       568.89
       5.267     0.998437        49870       640.00
       5.507     0.998633        49880       731.43
       5.807     0.998828        49890       853.33
       6.131     0.999023        49900      1024.00
       6.355     0.999121        49905      1137.78
       6.543     0.999219        49909      1280.00
       6.595     0.999316        49914      1462.86
       6.791     0.999414        49919      1706.67
       6.907     0.999512        49924      2048.00
       7.143     0.999561        49927      2275.56
       7.287     0.999609        49929      2560.00
       7.327     0.999658        49931      2925.71
       7.631     0.999707        49934      3413.33
       7.715     0.999756        49936      4096.00
       7.855     0.999780        49938      4551.11
       8.063     0.999805        49939      5120.00
       8.335     0.999829        49940      5851.43
       9.711     0.999854        49941      6826.67
       9.991     0.999878        49942      8192.00
      10.063     0.999890        49943      9102.22
      10.167     0.999902        49944     10240.00
      10.167     0.999915        49944     11702.86
      10.479     0.999927        49945     13653.33
      10.479     0.999939        49945     16384.00
      10.559     0.999945        49946     18204.44
      10.559     0.999951        49946     20480.00
      10.559     0.999957        49946     23405.71
      12.159     0.999963        49947     27306.67
      12.159     0.999969        49947     32768.00
      12.159     0.999973        49947     36408.89
      12.159     0.999976        49947     40960.00
      12.159     0.999979        49947     46811.43
      13.583     0.999982        49948     54613.33
      13.583     1.000000        49948          inf
#[Mean    =        1.480, StdDeviation   =        0.526]
#[Max     =       13.576, Total count    =        49948]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59986 requests in 1.00m, 4.26MB read
  Non-2xx or 3xx responses: 54271
Requests/sec:    999.73
Transfer/sec:     72.76KB